import React from "react";
import {
  StyleSheet,
  Text,
  SafeAreaView,
  ScrollView,
  StatusBar,
  Image,
} from "react-native";

const Function = () => {
  return (
    <SafeAreaView style={styles.container}>
      <ScrollView style={styles.scrollView}>
        <SafeAreaView style={styles.row}>
          <SafeAreaView style={styles.header}>
            <Text style={styles.header}>ความสัมพันธ์
            </Text>
          </SafeAreaView>
          <Text style={styles.text}>
            ความสัมพันธ์ในทางคณิตศาสตร์นั้น
            มีความคล้ายกับความสัมพันธ์ในชีวิตจริงที่เราคุ้นเคย
            คือเป็นการแสดงความเกี่ยวข้องกันของสองสิ่ง ซึ่งในทางคณิศาสตร์เรียกว่า
            คู่อันดับ ซึ่งมีนิยามดังนี้{"\n"}{"\n"}
            &emsp;คู่อันดับ คือ การนำสิ่งสองสิ่งมาเขียนคู่กัน โดยคำนึงถึงลำดับด้วย ซึ่งเขียนได้ดังนี้{"\n"}{"\n"}
            คู่อันดับ a, b เขียนแทนด้วย (a, b) โดยเรียก a ว่าสมาชิกตัวหน้าของคู่อันดับ
            และเรียก b ว่าสมาชิกตัวหลังของคู่อันดับ เช่น{"\n"}
            (โตเกียว, ญี่ปุ่น){"\n"}
            (มกราคม, 31){"\n"}
            (แบงค์, จอย){"\n"}
            (99, 38){"\n"}
            (-9, 36.9){"\n"}{"\n"}
          </Text>
          <Image
            style={{
              width: 400,
              height: 60,
              alignSelf: "center",
            }}
            source={require("../assets/sol7.png")}
          />
          <Text style={styles.text}>
            เมื่อรู้จักคู่อันดับแล้ว ความสัมพันธ์ มีนิยามดังต่อไปนี้{"\n"}
            &emsp;ความสัมพันธ์ คือ เซตที่มีสมาชิกทุกตัวเป็นคู่อันดับ
            โดยที่คู่อันดับแต่ละคู่ เกิดจากการจับคู่กันของสมาชิกจากเซตสองเซต
            เช่น{"\n"}
            {"{"}(A, X), (B, Y), (C, Z), (D, W){"}"}{"\n"}
            {"{"}(Galaxy Note 10, Samsung), (iPhone 11, Apple), (Find X, Oppo), …{"}"}{"\n"}
            {"{"}(1, 1), (2, 4), (3, 9), …{"}"}{"\n"}{"\n"}
            ตัวอย่างโจทย์ – จงหาค่า x,y เมื่อ (x + 1, 2y) = (-5, 11)
            </Text>
            <Image
            style={{
              width: 400,
              height: 274,
              alignSelf: "center",
            }}
            source={require("../assets/con6.png")}
          />
            <Text style={styles.text}>
             &emsp;ผลคูณคาร์ทีเชียน เป็นการกระทำกันระหว่างเซต 2 เซต โดยผลคูณคาร์ทีเชียนระหว่างเซต A และ B เขียนแทนด้วย A×B คือ เซตของคู่อันดับ (a,b) ทั้งหมด โดยที่ a เป็นสมาชิกของเซต A และ b เป็นสมาชิกของเซต B เขียนอยู่ในรูปแบบดังนี้{"\n"}
             </Text>
             <Image
            style={{
              width: 400,
              height: 72,
              alignSelf: "center",
            }}
            source={require("../assets/sol8.png")}
          />
          <Text style={styles.text}>
ตัวอย่างโจทย์ – จงหาผลคูณคาร์ทีระหว่างเซตต่อไปนี้ {"{"}a, b{"}"} และ {"{"}a, b, c{"}"}
</Text>
             <Image
            style={{
              width: 400,
              height: 60,
              alignSelf: "center",
            }}
            source={require("../assets/con7.png")}
          />
          <Text style={styles.text}>
            &emsp;สมบัติของผลคูณคาร์ทีเชียน ให้ A, B และ C เป็นเซตใด ๆ และ n(A) คือ
            จำนวนสมาชิกของเซต A{"\n"}
            A×{"{"}{"}"} = {"{"}{"}"}{"\n"}
            {"{"}{"}"}×A = {"{"}{"}"}{"\n"}
            A×(B∪C) = (A×B)∪(A×C){"\n"}
            A×(B∩C) = (A×B)∩(A×C){"\n"}
            A×(B-C) = (A×B) – (A×C){"\n"}
            n(A×B) = n(A).n(B){"\n"}{"\n"}
            &emsp;ความสัมพันธ์จาก A ไป B ให้ A และ B เป็นเซตใด ๆ
            แล้ว r เป็นความสัมพันธ์จาก A ไป B ก็ต่อเมื่อ r เป็นสับเซตของ AB
            เขียนได้ว่า{"\n"}{"\n"}
            r = {"{"}(a,b) | (a,b) ∈ A×B{"}"}{"\n"}{"\n"}
            &emsp;ความสัมพันธ์แบบมีเงื่อนไข คือ เซตของคู่อันดับ
            โดยที่สมาชิกตัวหน้าของแต่ละคู่อันดับ สัมพันธ์กับสมาชิกตัวหลัง
            ในรูปแบบเดียวกันในทุก ๆ คู่อันดับ เช่น{"\n"}
            A = {"{"}โตเกียว, กรุงเทพ, จาการ์ต้า, ปักกิ่ง, โซล{"}"}{"\n"}
            B = {"{"}ไทย, จีน, ญี่ปุ่น, เกาหลี, อินโดนีเซีย, อินเดีย, รัสเซีย{"}"}{"\n"}
            ความสัมพันธ์จาก A ไป B แบบ “เมืองหลวง – ประเทศ” คือ
            {"{"}(โตเกียว, ญี่ปุ่น), (กรุงเทพ, ไทย), (จาการ์ต้า, อินโดนีเซีย), (ปักกิ่ง, จีน), (โซล, เกาหลี){"}"}{"\n"}
            หรือเขียนแบบบอกเงื่อนไขได้ว่า
            {"{"}(a, b) ∈ A×B | a เป็นเมืองหลวงของ b{"}"}{"\n"}{"\n"}
            A = {"{"}1, 3, 5, 7, 9{"}"}{"\n"}
            ความสัมพันธ์จาก A ไป A แบบ “บวกกันได้ 10” คือ
            {"{"}(1, 9), (3, 7), (5, 5), (7, 3), (9, 1){"}"}{"\n"}
            หรือเขียนแบบบอกเงื่อนไขได้ว่า {"{"}(a, b) ∈ A×A | a + b = 10{"}"}{"\n"}{"\n"}
            กราฟของความสัมพันธ์ หากความสัมพันธ์
            เป็นความสัมพันธ์ระหว่างตัวเลขแล้ว
            เราสามารถเขียนความสัมพันธ์โดยใช้กราฟได้ โดยการนำคู่อันดับต่างๆ
            ของความสัมพันธ์ไปวาดลงบนกราฟ เช่น{"\n"}
            ให้ A = {"{"}0, 1, 2, 3, 4, 5{"}"}{"\n"}
            B = {"{"}5, 6, 7, …, 20{"}"}{"\n"}
            โดย r = {"{"}(x, y) ∈ A×B | y = 3x{"}"}{"\n"}
            แจกแจงสมาชิกได้เป็น r = {"{"}(2, 6), (3, 9), (4, 12), (5, 15){"}"}{"\n"}
            จะวาดกราฟได้ดังนี้
            </Text>
             <Image
            style={{
              width: 300,
              height: 300,
              alignSelf: "center",
            }}
            source={require("../assets/graph1.png")}
          />
          <Text style={styles.text}>ในกรณี r เป็นความสัมพันธ์ของจำนวนจริง
            มักจะวาดกราฟได้เป็นเส้น เช่น{"\n"}
            r = {"{"}(x, y) ∈ R×R | y = 3x{"}"}{"\n"}
            จะวาดกราฟได้ดังนี้
            </Text>
             <Image
            style={{
              width: 300,
              height: 300,
              alignSelf: "center",
            }}
            source={require("../assets/graph2.png")}
          />
          <Text style={styles.text}>
            เคล็ดลับการพิจารณากราฟ
            พิจารณากราฟของความสัมพันธ์ระหว่าง x และ y ได้ดังนี้{"\n"}
            กราฟจะผ่านจุด(a, b) เมื่อ แทนค่า a และ b ลงในสมการแล้วทำให้สมการเป็นจริง{"\n"}
            จุดตัดแกน x คือ จุดที่ y = 0 ถ้าแทนค่าแล้วสมการไม่เป็นจริงแสดงว่า ไม่มีจุดตัดแกน x{"\n"}
            จุดตัดแกน y คือ จุดที่ x = 0 ถ้าแทนค่าแล้วสมการไม่เป็นจริงแสดงว่า ไม่มีจุดตัดแกน y{"\n"}
            กราฟอยู่เหนือแกน x เมื่อ y {">"} 0{"\n"}
            กราฟอยู่ใต้แกน x เมื่อ y {"<"} 0{"\n"}
            ตัวอย่างโจทย์ – กราฟต่อไปนี้ผ่านจุด (0, 1) หรือไม่{"\n"}
            x + y = 1
            </Text>
             <Image
            style={{
              width: 400,
              height: 200,
              alignSelf: "center",
            }}
            source={require("../assets/con8.png")}
          />
          <Text style={styles.text}>
          x^2-y^2 = 1
          </Text>
             <Image
            style={{
              width: 400,
              height: 200,
              alignSelf: "center",
            }}
            source={require("../assets/con9.png")}
          />
          <Text style={styles.text}>
          ตัวอย่างโจทย์ – จงหาจุดตัดแกน x และ y ของกราฟต่อไปนี้{"\n"}
          2x + 1 = 3y
          </Text>
             <Image
            style={{
              width: 400,
              height: 650,
              alignSelf: "center",
            }}
            source={require("../assets/con10.png")}
          />
          <Text style={styles.text}>
            &emsp;โดเมนและเรนจ์ของความสัมพันธ์{"\n"}
            &emsp;โดเมนของความสัมพันธ์ r คือ เซตของ{"\n"}
            สมาชิกตัวหน้าของคู่อันดับทุกคู่ ในความสัมพันธ์ r
            โดเมนของความสัมพันธ์ r เขียนแทนด้วย Dr{"\n"}
            Dr = {"{"}x | (x, y) ∈ r{"}"}{"\n"}
            &emsp;เรนจ์ของความสัมพันธ์ r คือ เซตของ สมาชิกตัวหลังของคู่อันดับทุกคู่
            ในความสัมพันธ์ r เรนจ์ของความสัมพันธ์ r เขียนแทนด้วย Rr{"\n"}
            Rr ={"{"}y | (x, y) ∈ r{"}"}{"\n"}
            เช่น{"\n"}
            r = {"{"}(1, 3), (2, 8), (3, 10), (3, -5), (4, 19), (8, 3), (100, -5), (-9, 22){"}"}{"\n"}
            Dr = {"{"}1, 2, 3, 4, 8, 100, -9{"}"}{"\n"}
            Rr = {"{"}3, 8, 10, -5, 19, -5, 22{"}"}{"\n"}{"\n"}
            r = {"{"}(โตเกียว, ญี่ปุ่น), (กรุงเทพ, ไทย), (เบอร์ลิน, เยอรมันนี), (แคนเบอร์ร่า, ออสเตรเลีย), (โซล, เกาหลี), …{"}"}{"\n"}
            Dr = เซตของเมืองหลวงทั่วโลก{"\n"}
            Rr = เซตของประเทศทุกประเทศ
          </Text>
        </SafeAreaView>
        <SafeAreaView style={styles.row}>
          <SafeAreaView style={styles.header}>
            <Text style={styles.header}>ฟังก์ชัน
            </Text>
          </SafeAreaView>
          <Text style={styles.text}>
            &emsp;ฟังก์ชัน คือ
            ความสัมพันธ์รูปแบบหนึ่งที่สมาชิกในโดเมนแต่ละตัวจับคู่กับ
            สมาชิกในเรนจ์ของความสัมพันธ์ เพียงตัวเดียวเท่านั้น เช่น{"\n"}
            {"{"}(1,a), (2,b), (3,c), (4,d){"}"} เป็นฟังก์ชัน{"\n"}
            {"{"}(1,a), (2,a), (3,a), (4,a){"}"} เป็นฟังก์ชัน{"\n"}
            {"{"}(1,a), (1,b), (3,c), (4,d){"}"} ไม่เป็นฟังก์ชัน เพราะมี 1
            ที่จับคู่กับทั้ง a และ b{"\n"}{"\n"}
            ข้อสังเกตฟังก์ชันอย่างง่าย{"\n"}
            ถ้าสมาชิกตัวหน้าของแต่ละคู่อันดับไม่ซ้ำกัน จะเป็นฟังก์ชัน{"\n"}
            ถ้ามีสมาชิกตัวหน้าคู่อันดับซ้ำกัน อย่างน้อย 1 คู่อันดับ
            จะไม่เป็นฟังก์ชัน{"\n"}
            ความสัมพันธ์ที่มี y ยกกำลังเป็นเลขคู่ หรือ y
            อยู่ในเครื่องหมายค่าสัมบูรณ์ จะไม่เป็นฟังก์ชัน{"\n"}{"\n"}
            การนิยามฟังก์ชัน ถ้า
            f เป็นฟังก์ชัน และ (x, y) ∈ f จะได้ว่า y เป็นค่าของฟังก์ชัน f ที่ x
            เขียนแทนด้วย f(x) หรือ y = f(x) เรียก f(x) = (ค่าในเทอมของ x) ว่า
            นิยามของฟังก์ชัน ดังเช่น{"\n"}
            ถ้า f เป็นฟังก์ชันของ x แล้ว เราสามารถหาค่า
            f(k) ได้โดย{"\n"}
            สมมุติให้ x = k แล้วหาค่า f(x) เมื่อแทน x = k{"\n"}{"\n"}
            นิยามของฟังก์ชัน คือ f(x) = x^2 + 1{"\n"}{"\n"}
            f(5) คือ สมมุติ x = 5 หาค่า x^2 +1{"\n"}
            จะได้ว่า f(5) = 5^2 + 1 = 26{"\n"}{"\n"}
            f(-1) คือ สมมุติ x = -1 หาค่า x^2 + 1{"\n"}
            จะได้ว่า f(-1) = (-1)^2 + 1 = 2{"\n"}{"\n"}
            f(a + b) คือ สมมุติ x = a + b หาค่า x^2 + 1 จะได้ว่า{"\n"}
            f(a+b) = (a+b)^2 + 1 = a^2 + 2ab + b^2 + 1{"\n"}{"\n"}
            รูปแบบต่างๆของฟังก์ชัน มีดังต่อไปนี้{"\n"}
            ฟังก์ชันจาก A ไป B{"\n"}
            f เป็นฟังก์ชันจาก A ไป B เขียนแทนด้วย f:A→B{"\n"}
            หมายความว่า ทุกสมาชิกใน A ต้องมีคู่กับสมาชิกใน B
            </Text>
             <Image
            style={{
              width: 400,
              height: 320,
              alignSelf: "center",
            }}
            source={require("../assets/func1.png")}
          />
          <Text style={styles.text}>
            ฟังก์ชันจาก A ไปทั่วถึง B{"\n"}
            f เป็นฟังก์ชันจาก A
            ไปทั่วถึง B เขียนแทนด้วย f:A onto→ B{"\n"}
            หมายความว่า ทุกสมาชิกใน A และ B ต้องมีคู่
            </Text>
             <Image
            style={{
              width: 400,
              height: 320,
              alignSelf: "center",
            }}
            source={require("../assets/func2.png")}
          />
          <Text style={styles.text}>
            ฟังก์ชันหนึ่งต่อหนึ่งจาก A ไป B{"\n"}
            f เป็นฟังก์ชันหนึ่งต่อหนึ่งจาก A ไป B เขียนแทนด้วย f:A 1-1→ B{"\n"}
            หมายความว่า ทุกสมาชิกใน A ต้องมีคู่กับสมาชิกใน B และคู่ไม่ซ้ำ
            </Text>
             <Image
            style={{
              width: 400,
              height: 320,
              alignSelf: "center",
            }}
            source={require("../assets/func3.png")}
          />
          <Text style={styles.text}>
            ฟังก์ชันหนึ่งต่อหนึ่งจาก A ไปทั่วถึง B{"\n"}
            ถ้า f เป็นฟังก์ชันหนึ่งต่อหนึ่งจาก A ไป B และ f เป็นฟังก์ชันจาก A ไปทั่วถึง B{"\n"}
            แล้ว f เป็นฟังก์ชันหนึ่งต่อหนึ่งจาก A ไปทั่วถึง B
            เขียนแทนด้วย f:A 1-1 onto→ B
            </Text>
             <Image
            style={{
              width: 400,
              height: 320,
              alignSelf: "center",
            }}
            source={require("../assets/func4.png")}
          />
          <Text style={styles.text}>
          ตัวอย่างโจทย์{"\n"}
          ให้ A = {"{"}1, 2, 3, 4, 5{"}"}{"\n"}
          B = {"{"}4, 5, 6, 7{"}"}{"\n"}
          ฟังก์ชั้นต่อไปนี้เป็นฟังก์ชันประเภทใด เพราะเหตุใด{"\n"}
          f = {"{"}(1, 4), (2, 4), (3, 6){"}"}
          </Text>
             <Image
            style={{
              width: 400,
              height: 79,
              alignSelf: "center",
            }}
            source={require("../assets/con11.png")}
          />
          <Text style={styles.text}>
          f = {"{"}(1, 4), (2, 4), (3, 6), (4, 7), (5, 7){"}"}
          </Text>
             <Image
            style={{
              width: 320,
              height: 100,
              alignSelf: "center",
            }}
            source={require("../assets/con12.png")}
          />
          <Text style={styles.text}>
          f = {"{"}(1, 4), (2, 4), (3, 6), (4, 5), (5, 7){"}"}
          </Text>
             <Image
            style={{
              width: 400,
              height: 100,
              alignSelf: "center",
            }}
            source={require("../assets/con13.png")}
          />
          <Text style={styles.text}>
            ฟังก์ชันผกผันหรือฟังก์ชันอินเวอร์ส ให้
            f เป็นฟังก์ชันใด ๆ อินเวอร์สของฟังก์ชัน f เขียนแทนด้วย f^⁻¹{"\n"}
            ถ้า f^⁻¹ เป็นฟังก์ชันจะเรียก f^⁻¹นี้ว่า ฟังก์ชันอินเวอร์ส ถ้า f^⁻¹
            เป็นฟังก์ชันของ x จะเขียนได้ว่า f^⁻¹(x)โดยวิธีหา f^⁻¹ จะเหมือนกับการหา
            r^⁻¹ (ความสัมพันธ์อินเวอร์ส) เช่น{"\n"}{"\n"}
            ฟังก์ชัน y = 3x + 7
            อินเวอร์สของฟังก์ชันนี้ คือ x = 3y + 7 (ได้จากการสลับชื่อตัวแปร)
            จากนั้น จัดรูปใหม่ให้ y มาอยู่ด้านซ้ายของสมการ จะได้ y = (x-7)/3{"\n"}
            จะเขียนได้ว่า f = {"{"}(1, 2), (2, 4), (3, 8), (4, 7){"}"}{"\n"}
            f^⁻¹ = {"{"}(2, 1), (4, 2), (8, 3), (7, 4){"}"}{"\n"}{"\n"}
            ข้อสังเกต f^⁻¹ อาจไม่เป็นฟังก์ชัน{"\n"}
            f^⁻¹ จะเป็นฟังก์ชัน ก็ต่อเมื่อ f เป็นฟังก์ชันหนึ่งต่อหนึ่ง{"\n"}
            ถ้า f^⁻¹ เป็นฟังก์ชัน แล้ว f(a) = b
            จะได้ว่า f^⁻¹(b) = a{"\n"}{"\n"}
            การดำเนินการของฟังก์ชันให้ f และ g
            เป็นฟังก์ชันที่มีโดเมน และเรนจ์เป็นสับเซตของจำนวนจริง
            จะมีวิธีการดำเนินการระหว่างฟังก์ชันดังนี้
            วิธีการดำเนินการระหว่างฟังก์ชัน
            </Text>
             <Image
            style={{
              width: 400,
              height: 114,
              alignSelf: "center",
            }}
            source={require("../assets/con14.png")}
          />
          <Text style={styles.text}>
          ตัวอย่างโจทย์ ให้ f(x) = 2x + 3 และ g(x) = x^² – 1 จงหา (f – g)(2)
          </Text>
          <Image
            style={{
              width: 400,
              height: 157,
              alignSelf: "center",
            }}
            source={require("../assets/con15.png")}
          />
        </SafeAreaView>
      </ScrollView>
    </SafeAreaView>
  );
};

const styles = StyleSheet.create({
  container: {
    flex: 1,
    alignItems: "center",
    justifyContent: "center",
    paddingTop: StatusBar.currentHeight,
    backgroundColor: "#FFC768",
  },
  scrollView: {
    marginHorizontal: 20,
  },
  text: {
    fontSize: 20,
    alignSelf: "center",
  },
  row: {
    backgroundColor: "#fff",
  },
  header: {
    flexDirection: "row",
    justifyContent: "center",
    alignItems: "center",
    backgroundColor: "#D91200",
    color: "white",
    fontSize: 30,
    fontWeight: "bold",
  },
});


export default Function;
